rainer20512/stm32-fw/common/src/dev/fmc_dev.c
/*
 ******************************************************************************
 * @file    fmc_dev.c
 * @author  Rainer
 * @brief  FMC hardware wrapped into HW_Device
 *
 *****************************************************************************/

/** @addtogroup QUADSPI
  * @{
   
*/
#include "config/config.h"

#if USE_FMC > 0 

/* Debug ------------------------------------------------------------------------*/
#define DEBUG_FMC          1

#include "config/devices_config.h"
#include "config/fmc_config.h"
#include "dev/fmc_dev.h"
#include "system/hw_util.h"

#include "error.h"
#include "task/minitask.h"

#include "debug_helper.h"

/* My macros --------------------------------------------------------------------*/
#define BANK_TO_IDX(bank_id)   ((bank_id) >> 1)
#define IDX_TO_BANK(idx)       (idx << 1)
#define BITS_TO_MASK(nrofbits)  ((1ULL << (nrofbits))-1)

/* Private typedef --------------------------------------------------------------*/
typedef struct {
     uint32_t accessMode;             /* access mode ( one of FMC_ACCESS_MODE_xxx, where xxx=A,B,C,D )         */
     uint8_t  AddrBits;               /* number of address bits of ext mem chip                                */
     uint8_t  DataBits;               /* number of data bits of ext mem chip ( only 8 or 16 are valid for sram */
     uint8_t  AD_Muxed;               /* != 0, when Data and address bits are multiplexed                      */
     uint16_t T_AddrSet;              /* memories Address setup time [ns] */
     uint16_t T_AddrHold;             /* Memories Address hold time  [ns] */
     uint16_t T_DataSet;              /* Memories Data setup time    [ns] */
} Fmc_SramTimingDataT;

typedef struct {
     uint32_t modeReg;                /* chip specific mode register setting                                   */
     uint8_t  RowBits;                /* number of row address bits of ext mem chip                            */
     uint8_t  ColBits;                /* number of column address bits of ext mem chip                         */
     uint8_t  DataBits;               /* number of data bits of ext mem ( only 8,16 and 32 are valid f. sdram) */
     uint8_t  sdramBankNum;           /* SDRAM bank number (1 or 2)       */
     uint8_t  N_CASLatency;           /* specific CAS Latency             */
     uint16_t T_Refresh;              /* Refreshrate [ms]                 */
     FMC_SDRAM_TimingTypeDef times_ns;/* The chip specific times in ns    */
} Fmc_SdramTimingDataT;

typedef struct {
     const void *fmcTiming;           /* Ptr to corresponding timing data */
     uint8_t fmcType;                 /* type of FMC external memory */
} Fmc_ExtMemDataT;

typedef struct {
    FmcHandleT              *myFmcHandle;    /* my associated handle */
    const Fmc_ExtMemDataT   *myExtMemData[FMC_MAX_BLOCKS];
} Fmc_AdditionalDataType;

/* Private or driver functions ------------------------------------------------------*/
static  FmcHandleT * Fmc_GetMyHandle(const HW_DeviceType *self)
{
    return ((Fmc_AdditionalDataType *)(self->devData))->myFmcHandle;
}

static const Fmc_ExtMemDataT * Fmc_GetMyExtMemData(const HW_DeviceType *self, uint32_t idx)
{
    return ((Fmc_AdditionalDataType *)(self->devData))->myExtMemData[idx];
}


/******************************************************************************
 * Add/enable the IO lines required by the current FMC bank with respect to the
 * io lines enabled so far
 *****************************************************************************/
static void FmcAddIOLines(FmcDataT *curr)
{
    uint32_t         i;
    uint32_t         delta;
    GPIO_InitTypeDef Init;
    uint32_t         devIdx;

    Init.Mode  = GPIO_MODE_AF_PP;
    Init.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    devIdx     = (uint32_t)GetDevIdx(&HW_FMC);

    /* Enable all data lines, that are not enabled so far */
    delta = curr->fmcDataBits & ~FmcHandle.allDataBits;
    for ( i = 0 ; i < FMC_D_MAX; i++ ) if ( delta & ( 1 << i ) )
        GpioAFInitOne (devIdx, &(HW_FMC.devGpioAF->gpio[i]), &Init );
    FmcHandle.allDataBits |= delta;

    /* Enable all address lines, that are not enabled so far */
    delta = curr->fmcAddrBits & ~FmcHandle.allAddrBits;
    for ( i = 0 ; i < FMC_A_MAX; i++ ) if ( delta & ( 1 << i ) )
        GpioAFInitOne (devIdx, &(HW_FMC.devGpioAF->gpio[FMC_D_MAX+i]), &Init );
    FmcHandle.allAddrBits |= delta;

    /* Enable all control lines, that are not enabled so far */
    delta = curr->fmcCtlBits & ~FmcHandle.allCtlBits;
    for ( i = 0 ; i < FMC_CTL_MAX; i++ ) if ( delta & ( 1 << i ) )
        GpioAFInitOne (devIdx, &(HW_FMC.devGpioAF->gpio[FMC_D_MAX+FMC_A_MAX+i]), &Init );
    FmcHandle.allCtlBits |= delta;
}

/******************************************************************************
 * Clear the entire CanHandleT structure
 *****************************************************************************/
static void FmcResetMyHandle ( FmcHandleT *handle ) 
{
    memset(handle, 0, sizeof(FmcHandleT) );
}


/**************************************************************************************
 * Some Devices support different clock sources for FSMC. On configurable FMC Clock   *
 * sources, we assume that FMC Clock source is HCLK. In any case make sure, that      *   
 * Fmc_SetClockSource and Fmc_GetClockSpeed() will match                              *
 *************************************************************************************/
#if defined(STM32L476xx) || defined(STM32L496xx)
    /* STM32L4xx has no clock mux for FMC device */
    #define Fmc_SetClockSource(a)           (true)
    #define Fmc_GetClockSpeed()             HAL_RCC_GetHCLKFreq()
#elif defined(STM32H745xx) || defined(STM32H742xx)  || defined(STM32H743xx)
    static bool Fmc_SetClockSource(const void *hw)
    {
      UNUSED(hw);
      RCC_PeriphCLKInitTypeDef PeriphClkInit;

      /* FSMC has to be operated with HCLK. Routines, which will set      */
      /* FMC timing constants, will call Fmc_GetClockSpeed() to determine */
      /* the current clock speed                                          */

      PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_FMC; 
      PeriphClkInit.FmcClockSelection    = RCC_FMCCLKSOURCE_D1HCLK;

