rainer20512/stm32-fw/common/src/dev/fmc_dev.c
      if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK) {
        DEBUG_PUTS("failed to set CLK source for FSMC");
        return false;
      }

      return true;
    }
    #define Fmc_GetClockSpeed()             HAL_RCC_GetHCLKFreq()
#else 
    #error "No FMC clock assignment defined"
#endif


#if DEBUG_MODE >  0

    const char * const memtype_txt[]={"SRAM","NOR", "NAND"};
    static const char* fmc_get_memtype_txt(uint32_t sel )
    {
      if ( sel < sizeof(memtype_txt)/sizeof(char *) ) 
        return memtype_txt[sel];
      else
        return "Illegal";
    }

    const char * const fmcctl_txt[] = FMC_CTL_STR;
    static const char* fmc_get_ctl_txt(uint32_t sel )
    {
      if ( sel < sizeof(fmcctl_txt)/sizeof(char *) ) 
        return fmcctl_txt[sel];
      else
        return "Illegal";
    }

    static void FmcPrintCtlText( uint32_t bits )
    {
        uint32_t mask = 1;
        uint32_t idx = 0;
        while ( idx < FMC_CTL_MAX ) {
            if ( mask & bits )  DEBUG_PRINTF("%s ", fmc_get_ctl_txt(idx));
            mask <<= 1;
            idx++;
        }
    }

    static void FmcPrintBitVector ( const char *prefix, uint32_t bits, uint32_t maxidx )
    {
        uint32_t mask;
        uint32_t idx;
        uint32_t highest = 0;   /* highest set bit */

        mask = 1;
        idx = 0;

        while ( bits ) {
            // find lowest set bit //
            while ( idx < maxidx && ( mask & bits ) == 0 ) {
                mask <<= 1;
                idx++;
            }

            if ( idx >= maxidx ) return;

            DEBUG_PRINTF("%s%02d...", prefix, idx );

            // find highest set bit //
            while ( idx < maxidx && ( mask & bits )  ) {
                highest = idx;
                bits &= ~mask;
                mask <<= 1;
                idx++;
            }
            DEBUG_PRINTF("%s%02d ", prefix, highest );
    
        }
    }


    /**************************************************************************************
     * Dump the FMC parameters  *
     *************************************************************************************/
    static void FMC_DumpOneSramGeometry(uint32_t idx, FmcDataT *curr)
    {


        /* Get Timing data */
        Fmc_SramTimingDataT *sram_timing = (Fmc_SramTimingDataT *)(Fmc_GetMyExtMemData(&HW_FMC, idx)->fmcTiming);
        
        DEBUG_PRINTF("FMC Bank %d:\n", idx);
        if ( curr->fmcIsUsed ) {
            DEBUG_PRINTF("   Type:  %s\n", fmc_get_memtype_txt(curr->fmcType));
            DEBUG_PRINTF("   Muxed: %s\n", curr->fmcIsMuxed ? "yes" : "no" );
            if ( curr->fmcIsMuxed ) {
                DEBUG_PRINTF("   Addr/Data: ");FmcPrintBitVector("DA",curr->fmcDataBits, FMC_D_MAX);DEBUG_PRINTF("\n");
            } else {
                DEBUG_PRINTF("   Data: ");FmcPrintBitVector("D",curr->fmcDataBits, FMC_D_MAX);DEBUG_PRINTF("\n");
            }
            DEBUG_PRINTF("   Addr: ");FmcPrintBitVector("A",curr->fmcAddrBits, FMC_A_MAX);DEBUG_PRINTF("\n");
            DEBUG_PRINTF("   Ctl:  ");FmcPrintCtlText(curr->fmcCtlBits);DEBUG_PRINTF("\n");
            
            /* capacity in kBytes and start address */
            uint32_t capa = (1 << sram_timing->AddrBits ) * sram_timing->DataBits/8/1024;
            uint32_t base = 0x60000000 + 0x4000000 * idx;
             
            DEBUG_PRINTF("Organisation:       2^%d x %d bit\n", sram_timing->AddrBits, sram_timing->DataBits );
            DEBUG_PRINTF("Resulting capacity: %dKB or %dMB\n", capa, capa/1024);
            DEBUG_PRINTF("Address Range     : 0x%08x ... 0x%08x\n", base, base+capa*1024-1);
            DEBUG_PRINTF("Timing parameters:\n");
            DEBUG_PRINTF("Address setup time: %dns\n",sram_timing->T_AddrSet);
            DEBUG_PRINTF("Data setup time:    %dns\n",sram_timing->T_DataSet);
            if ( curr->fmcIsMuxed ) 
                DEBUG_PRINTF("Address hold time  %dns\n",sram_timing->T_AddrHold);
        } else {
            DEBUG_PUTS("   unused");
        }
    }

    /**************************************************************************************
     * Dump the FMC parameters  for a SDRAM bank*
     *************************************************************************************/
    static void FMC_DumpOneSdramGeometry(uint32_t idx, FmcDataT *curr)
    {


        /* Get Timing data */
        Fmc_SdramTimingDataT *sdram_data = (Fmc_SdramTimingDataT *)(Fmc_GetMyExtMemData(&HW_FMC, idx)->fmcTiming);
        
        DEBUG_PRINTF("internal bank #%d", idx);
        if ( curr->fmcIsUsed || curr->fmcType != FMC_TYPE_SDRAM ) {
            DEBUG_PRINTF(" / SDRAM-Bank #%d\n", sdram_data->sdramBankNum);
            DEBUG_PRINTF("   %2d row bits\n", sdram_data->RowBits);
            DEBUG_PRINTF("   %2d col bits\n", sdram_data->ColBits);
            DEBUG_PRINTF("    2 bank select bits\n");
            DEBUG_PRINTF("   %2d data bits\n", sdram_data->DataBits);
            DEBUG_PRINTF("   Addr: ");FmcPrintBitVector("A",curr->fmcAddrBits, FMC_A_MAX);DEBUG_PRINTF("\n");
            DEBUG_PRINTF("   Data: ");FmcPrintBitVector("D",curr->fmcDataBits, FMC_D_MAX);DEBUG_PRINTF("\n");
            DEBUG_PRINTF("   Ctl:  ");FmcPrintCtlText(curr->fmcCtlBits);DEBUG_PRINTF("\n");
            
            /* capacity in kBytes and start address */
            uint32_t capa = (1 << (sdram_data->RowBits+sdram_data->ColBits+2)) * sdram_data->DataBits/8/1024;
            uint32_t base = 0xC0000000 + 0x10000000 * (sdram_data->sdramBankNum-1);
            DEBUG_PRINTF("Resulting capacity: %dKB or %dMB\n", capa, capa/1024);
            DEBUG_PRINTF("Address Range     : 0x%08X ... 0x%08X\n", base, base+capa*1024-1);
            /* SDRAM controller is initialized with a fixed clock prescaler of 2 */
            DEBUG_PRINTF("SDRAM Clk Freq.   : %dMHz\n", Fmc_GetClockSpeed()/2/1000000);
            DEBUG_PRINTF("Timing parameters:\n");
        } else {
            DEBUG_PUTS("   unused or type is not SDRAM");
        }
    }
#endif

void FMC_DumpGeometry(void)
{

