rainer20512/stm32-fw/common/src/dev/fmc_dev.c
    for ( uint32_t i=0; i < FMC_MAX_BLOCKS; i++) {
        #if DEBUG_MODE > 0 
            FMC_DumpOneSramGeometry(i, FmcHandle.fmcData+i);
        #endif
    }
    #if DEBUG_MODE > 0
        DEBUG_PRINTF("Resulting Data lines:"); FmcPrintBitVector("D",FmcHandle.allDataBits, FMC_D_MAX);DEBUG_PRINTF("\n");
        DEBUG_PRINTF("Resulting Addr lines:"); FmcPrintBitVector("A",FmcHandle.allAddrBits, FMC_A_MAX);DEBUG_PRINTF("\n");
        DEBUG_PRINTF("Resulting Ctl  lines:"); ;FmcPrintCtlText(FmcHandle.allCtlBits);DEBUG_PRINTF("\n");
    #endif
}


/*
 * Init or DeInit Clock / clocksource 
 */
static bool Fmc_ClockInit(const HW_DeviceType *self, bool bDoInit)
{
    /* Select clock source on init*/
    if ( bDoInit ) {
        if ( !Fmc_SetClockSource( self->devBase ) ) return false;
    }

    /* Enable/Disable clock */
    HW_SetHWClock( (void*)self->devBase, bDoInit );
    return true;
}

/******************************************************************************
 * Set then HAL Timing parameters ( in multiples of fmc_ker_ck ) on base of the
 * passed "myTiming"-times (in nanoseconds ).
 * 0 will be returned, if timing data is not settable (due to limited bitwidth
 * of HAL (resp FMC) timing data fields.
 * The underlying FMC clock speed [Hz] will be returned on success
 *****************************************************************************/
static uint32_t Fmc_SetSramTiming( FMC_NORSRAM_TimingTypeDef *halTiming, const Fmc_SramTimingDataT *myTiming )
{
    #define MIN_ADDSET       0         /* min clk cycles for address setup time */
    #define MAX_ADDSET      15         /* max clk cycles for address setup time */
    #define MIN_ADDHLD       1         /* min clk cycles for address hold  time */
    #define MAX_ADDHLD      15         /* max clk cycles for address hold  time */
    #define MIN_DATASET      1         /* min clk cycles for data setup time    */
    #define MAX_DATASET    255         /* max clk cycles for data setup time    */

    uint32_t work;
    uint32_t newClkHz = Fmc_GetClockSpeed();

    /* number of picosecs per FMC clock cycle */
    uint32_t ps_per_clk = 1000000 / (newClkHz/1000000);

    /* Address setup time */
    work = myTiming->T_AddrSet;
    work = ( work * 1000 + ps_per_clk - 1 )  / ps_per_clk;
    if ( work > MAX_ADDSET ) {
        DEBUG_PRINTF("Desired address setup time of %d clk cycles too big\n",work);
        work = MAX_ADDSET; // return false;
    }
    halTiming->AddressSetupTime = work;

    /* Address hold time */
    work = myTiming->T_AddrHold;
    work = ( work * 1000 + ps_per_clk - 1 )  / ps_per_clk;
    if ( work > MAX_ADDHLD ) {
        DEBUG_PRINTF("Desired address hold time of %d clk cycles too big\n",work);
        work = MAX_ADDHLD; // return false;
    }
    halTiming->AddressHoldTime = MAX(MIN_ADDHLD, work);

    /* data setup time */
    work = myTiming->T_DataSet;
    work = ( work * 1000 + ps_per_clk - 1 )  / ps_per_clk;
    if ( work > MAX_DATASET ) {
        DEBUG_PRINTF("Desired data setup time of %d clk cycles too big\n",work);
        work = MAX_DATASET; // return false;
    }
    halTiming->DataSetupTime = MAX(MIN_DATASET, work);

    /* Don#t care, but should be set */
    halTiming->BusTurnAroundDuration  = 0;
    halTiming->CLKDivision            = 2;
    halTiming->DataLatency            = 2;
   
    halTiming->AccessMode             = myTiming->accessMode;

    return newClkHz;
}

/******************************************************************************
 * Do the Initialization of an SRAM bank.
 * Parameters:
 *    fmc_idx     - FMC bank index [0 .. 3]
 *    sram_timing - neccessary timing and size parameters
 * initializes all associated IO pins and initializes the FMC bank. After return
 * the FMC bank is enabled/visible at its prefined memory address range
 * Returns
 *    true on success
 *    false in case of parameter or HAL layer initialization error
 *****************************************************************************/
bool Fmc_SRAM_Init(uint32_t fmc_idx, Fmc_SramTimingDataT *sram_timing )
{
    FMC_NORSRAM_InitTypeDef     *init;
    FMC_NORSRAM_TimingTypeDef   SRAM_Timing;
    
    FmcDataT *curr   = FmcHandle.fmcData+fmc_idx; 
    
    /* Check for selected FMC bank being unused */
    if ( curr->fmcIsUsed ) {
        DEBUG_PRINTF("Fmc Bank #%d already used\n",  fmc_idx );
        return false;
    }

    /* SRAM device configuration */  

//    uint32_t idx         = BANK_TO_IDX(Init->NSBank);
    curr->fmcRefClockSpeed = Fmc_SetSramTiming( &SRAM_Timing, sram_timing );
    if ( curr->fmcRefClockSpeed == 0  ) {
        DEBUG_PRINTF("Timing setup of Fmc Bank #%d failed\n",  fmc_idx );
        return false;
    }

    /* Check DataWidth to be 8 or 16 */
    if ( sram_timing->DataBits != 8 && sram_timing->DataBits != 16 ) {
        DEBUG_PRINTF("Data Width of Fmc Bank #%d invalid\n",  fmc_idx );
        return false;
    }

    curr->fmcIsUsed      = 1;
    curr->fmcType        = FMC_TYPE_SRAM;
    curr->fmcIsMuxed     = sram_timing->AD_Muxed;
    curr->fmcDataBits    = sram_timing->DataBits; 
    curr->fmcDataBits    = BITS_TO_MASK(curr->fmcDataBits);
    curr->fmcAddrBits    = BITS_TO_MASK(sram_timing->AddrBits);

    /* In case of multiplexed address/data, exclude the multiplexed address lines */
    if ( curr->fmcIsMuxed) curr->fmcAddrBits &= ~(curr->fmcDataBits);

    /* Enable NBL0, NBL1, NOE, NWE and selected enable-line */
    curr->fmcCtlBits     = 1 << FMC_NBL0_OFS | 1 << FMC_NBL1_OFS | 1 << FMC_NOE_OFS | 1 << FMC_NWE_OFS | 1 << ( FMC_NE1_OFS + fmc_idx ) ;

    /* enable Address valid line in muxed mode */
    if ( curr->fmcIsMuxed ) curr->fmcCtlBits |= ( 1 << FMC_NL_OFS );

    curr->hHal.hsram.Instance  = FMC_NORSRAM_DEVICE;
    curr->hHal.hsram.Extended  = FMC_NORSRAM_EXTENDED_DEVICE;
    init                       = &curr->hHal.hsram.Init;

    init->MemoryType         = FMC_MEMORY_TYPE_SRAM;
    init->NSBank             = IDX_TO_BANK(fmc_idx);
    init->DataAddressMux     = curr->fmcIsMuxed ? FMC_DATA_ADDRESS_MUX_ENABLE : FMC_DATA_ADDRESS_MUX_DISABLE;
    init->MemoryDataWidth    = curr->fmcDataBits == 8 ? FMC_NORSRAM_MEM_BUS_WIDTH_8 : FMC_NORSRAM_MEM_BUS_WIDTH_16;
    init->BurstAccessMode    = FMC_BURST_ACCESS_MODE_DISABLE;
    init->WaitSignalPolarity = FMC_WAIT_SIGNAL_POLARITY_LOW;
    init->WaitSignalActive   = FMC_WAIT_TIMING_BEFORE_WS;
    init->WriteOperation     = FMC_WRITE_OPERATION_ENABLE;
    init->WaitSignal         = FMC_WAIT_SIGNAL_DISABLE;
    init->ExtendedMode       = FMC_EXTENDED_MODE_DISABLE;
    init->AsynchronousWait   = FMC_ASYNCHRONOUS_WAIT_DISABLE;
    init->WriteBurst         = FMC_WRITE_BURST_DISABLE;
    init->ContinuousClock    = FMC_CONTINUOUS_CLOCK_SYNC_ONLY;
    init->PageSize           = FMC_PAGE_SIZE_NONE;
    init->WriteFifo          = FMC_WRITE_FIFO_ENABLE;


#if defined(STM32L476EVAL)
    /* When using STM32L476-EVAL with glass LCD deployed, also activate FMCs NE3 select line to deactivate LCD data output */
    curr->fmcCtlBits |= 1 << ( FMC_NE3_OFS );
#endif


    /* enable io lines and keep track of all activated IO lines  */
    FmcAddIOLines(curr);
 
    if ( HAL_SRAM_Init(&curr->hHal.hsram, &SRAM_Timing, &SRAM_Timing) != HAL_OK ) {
        DEBUG_PRINTF("SRAM init for Fmc Bank #%d failed\n",  fmc_idx );
        curr->fmcIsUsed = 0;
        return false;
    }

    FMC_DumpOneSramGeometry(fmc_idx, curr);

