rainer20512/stm32-fw/common/src/dev/fmc_dev.c
    return true;
}

/******************************************************************************
 * Compute value of the refresh counter, see 74x refman, section "SDRAM refresh timer register" 
 * Refresh time from row to row is total refresh time (usually 64ms ) / number of rows converted to sdram clk cycles
 * Params
 *    myData     - SDRAM timing data stored in flash
 *    sdramClkHz - actual SDRAM clk speed. Is usually half the FMC input clock
 * Returns
 *    the new refresh counter value for the SDRAM at the specified SDRAM clk
 *    0 on failure
 *****************************************************************************/
static uint32_t Fmc_CalcSdram_RefreshCounter(const Fmc_SdramTimingDataT *myData, uint32_t sdramClkHz )
{
    /* Hardware defined margins for the SDRAM counter [ 41 .. 8191 ] */
    #define MIN_CNT_VALUE   41
    #define MAX_CNT_VALUE   ((1U<<13)-1)

    uint32_t clkPerRow = (myData->T_Refresh * (sdramClkHz/1000) ) / ( 1 << myData->RowBits );   
    
    /* subtract 20 as safety margin */
    clkPerRow -= 20;

    /* check range */
    if ( clkPerRow < MIN_CNT_VALUE || clkPerRow > MAX_CNT_VALUE ) {
            DEBUG_PRINTF("Refresh counter value out of range, Value=%d\n",clkPerRow);
            return 0;
    }
    
    return clkPerRow;
}

/******************************************************************************
 * Set then HAL Timing parameters ( in multiples of fmc_ker_ck ) on base of the
 * passed "myTiming"-times (in nanoseconds ).
 * Parameters:
 * halTiming - FMC_SDRAM_TimingTypeDef structure, which will contain the sdram
 *             timing parameters [in sdram clk cycles] upon return
 * newCounterVal - New refresh counter value [in sdram clk cycles]. Has to be
 *                 programmed to the refresh counter register after return
 * myData    - all the internal sdram specific data and times
 *
 * 0 will be returned, if timing data is not settable (due to limited bitwidth
 * of HAL (resp FMC) timing data fields.
 * the underlying SDRAM clk speed [Hz]  will be returned on success. 
 *
 * NOTE: SDRAM clk is half the FMC input clock
 *
 *****************************************************************************/
static uint32_t Fmc_SetSdramTiming(FMC_SDRAM_TimingTypeDef *halTiming, const Fmc_SdramTimingDataT *myData )
{
   
    /* all timing parameters must be in the range [ 1 .. 16] ... */
    #define MIN_TXX_VALUE    1 
    #define MAX_TXX_VALUE   16 

    /*
     * convert a timinng value in ns to the corresponding value in sdram clk cycles 
     * value is always rounded up to the next greater integral value                
     * 0 is returned in case of value out of range [ 1 .. 16 ]
     */
    uint32_t convert ( uint32_t inval_ns, uint32_t picos_per_clk, const char *errtxt )
    {
        /* Convert to ps, round to next integral value and convert back to ns */
        register uint32_t retval = ( inval_ns * 1000 + picos_per_clk - 1 )  / picos_per_clk;
        /* check range */
        if ( retval > MAX_TXX_VALUE ) {
            DEBUG_PRINTF("%s, Value=%d\n",errtxt, retval);
            retval = 0; 
        }
        return retval;
    }

#if 0
    halTiming->LoadToActiveDelay    = 2;    // tMRD - Mode Register program time -> 12ns
    halTiming->ExitSelfRefreshDelay = 7;    // tXSR - Self refresh exit time     -> 70ns 
    halTiming->SelfRefreshTime      = 4;    // min. self refresh period = tRAS   -> 40ns
    halTiming->RowCycleDelay        = 7;    // tRC  - Command Period/Act-to-Act  -> 67.5ns
    halTiming->WriteRecoveryTime    = 2;    // tRAS-rRCD -> 40-20                -> 20ns
    halTiming->RPDelay              = 2;    // tRP  - Precharge to Active Delay  -> 18ns 
    halTiming->RCDDelay             = 2;    // tRCD - Active to Read/Write Delay -> 18ns 
#endif

    /* SDRAM clk is FMC input clock / 2 */
    uint32_t newClkHz = Fmc_GetClockSpeed() / 2;
 
    /* number of picosecs per SDRAM clock cycle */
    uint32_t ps_per_clk = 1000000 / (newClkHz/1000000);

    const FMC_SDRAM_TimingTypeDef *nstimes = &myData->times_ns;

    /* All SDRAM timing parameters are in units of SDRAM clk cycles */

    if ( (halTiming->LoadToActiveDelay    = convert( nstimes->LoadToActiveDelay,    ps_per_clk, "tMRD out of range" )) == 0) return 0;
    if ( (halTiming->ExitSelfRefreshDelay = convert( nstimes->ExitSelfRefreshDelay, ps_per_clk, "tXSR out of range" )) == 0) return 0;
    if ( (halTiming->SelfRefreshTime      = convert( nstimes->SelfRefreshTime,      ps_per_clk, "tRAS out of range" )) == 0) return 0;
    if ( (halTiming->RowCycleDelay        = convert( nstimes->RowCycleDelay,        ps_per_clk, "tRC out of range" ))  == 0) return 0;
    if ( (halTiming->WriteRecoveryTime    = convert( nstimes->WriteRecoveryTime,    ps_per_clk, "tWR out of range" ))  == 0) return 0;
    if ( (halTiming->RPDelay              = convert( nstimes->RPDelay,              ps_per_clk, "tRP out of range" ))  == 0) return 0;
    if ( (halTiming->RCDDelay             = convert( nstimes->RCDDelay,             ps_per_clk, "tRCD out of range" )) == 0) return 0;

    return newClkHz;
}

#define SDRAM_TIMEOUT                    ((uint32_t)0xFFFF)
#define REFRESH_COUNT                    ((uint32_t)0x0603)   /* SDRAM refresh counter */

/******************************************************************************
 * @brief  Perform the SDRAM exernal memory inialization sequence 
 *         This step has to be done once on startup
 * @param  hsdram: SDRAM handle
 * @param  Command: Pointer to SDRAM command structure
 * @retval None
 *****************************************************************************/
static void SDRAM_Initialization(SDRAM_HandleTypeDef *hsdram, uint32_t sdramTargetNum )
{
  FMC_SDRAM_CommandTypeDef Command;

  /* Note the difference between FMC_SDRAM_BANKx and FMC_SDRAM_CMD_TARGET_BANKx ! */
  uint32_t cmdTarget = sdramTargetNum == FMC_SDRAM_BANK1 ? FMC_SDRAM_CMD_TARGET_BANK1 : FMC_SDRAM_CMD_TARGET_BANK2;

  /* Step 1:  Configure a clock configuration enable command */
  Command.CommandMode = FMC_SDRAM_CMD_CLK_ENABLE;
  Command.CommandTarget = cmdTarget;
  Command.AutoRefreshNumber = 1;
  Command.ModeRegisterDefinition = 0;

