rainer20512/stm32-fw/common/src/dev/fmc_dev.c
  /* Send the command */
  HAL_SDRAM_SendCommand(hsdram, &Command, SDRAM_TIMEOUT);

  /* Step 2: Insert 100 us minimum delay */
  /* Inserted delay is equal to 1 ms due to systick time base unit (ms) */
  HAL_Delay(1);

  /* Step 3: Configure a PALL (precharge all) command */
  Command.CommandMode = FMC_SDRAM_CMD_PALL;
  Command.CommandTarget = cmdTarget;
  Command.AutoRefreshNumber = 1;
  Command.ModeRegisterDefinition = 0;

  /* Send the command */
  HAL_SDRAM_SendCommand(hsdram, &Command, SDRAM_TIMEOUT);
}

static void SDRAM_AutoRefresh(SDRAM_HandleTypeDef *hsdram, uint32_t sdramTargetNum, uint32_t modeReg, uint32_t refresh_counter)
{
  FMC_SDRAM_CommandTypeDef Command;
  /* Note the difference between FMC_SDRAM_BANKx and FMC_SDRAM_CMD_TARGET_BANKx ! */
  uint32_t cmdTarget = sdramTargetNum == FMC_SDRAM_BANK1 ? FMC_SDRAM_CMD_TARGET_BANK1 : FMC_SDRAM_CMD_TARGET_BANK2;

  /* Step 4 : Configure a Auto-Refresh command */
  Command.CommandMode = FMC_SDRAM_CMD_AUTOREFRESH_MODE;
  Command.CommandTarget = cmdTarget;
  Command.AutoRefreshNumber = 8;
  Command.ModeRegisterDefinition = 0;

  /* Send the command */
  HAL_SDRAM_SendCommand(hsdram, &Command, SDRAM_TIMEOUT);

  Command.CommandMode = FMC_SDRAM_CMD_LOAD_MODE;
  Command.CommandTarget = cmdTarget;
  Command.AutoRefreshNumber = 1;
  Command.ModeRegisterDefinition = modeReg;

  /* Send the command */
  HAL_SDRAM_SendCommand(hsdram, &Command, SDRAM_TIMEOUT);

  /* Step 6: Set the refresh rate counter */
  /* Set the device refresh rate */
  HAL_SDRAM_ProgramRefreshRate(hsdram, refresh_counter); 

}

static void SDRAM_SelfRefresh(SDRAM_HandleTypeDef *hsdram, uint32_t sdramTargetNum)
{
  FMC_SDRAM_CommandTypeDef Command;
  /* Note the difference between FMC_SDRAM_BANKx and FMC_SDRAM_CMD_TARGET_BANKx ! */
  uint32_t cmdTarget = sdramTargetNum == FMC_SDRAM_BANK1 ? FMC_SDRAM_CMD_TARGET_BANK1 : FMC_SDRAM_CMD_TARGET_BANK2;

  /* Configure a Self refresh command */
  Command.CommandMode = FMC_SDRAM_CMD_SELFREFRESH_MODE;
  Command.CommandTarget = cmdTarget;
  Command.AutoRefreshNumber = 1;
  Command.ModeRegisterDefinition = 0;

  /* Send the command */
  HAL_SDRAM_SendCommand(hsdram, &Command, SDRAM_TIMEOUT);
}


/* Convert cas latency to register values */
#define ENC_CAS_LATENCY(lat)    (lat<<7)

/* Convert column bit number to register value */
#define ENC_COL_BITS(col)       (col-8)

/* Convert row bit number to register value */
#define ENC_ROW_BITS(row)       ((row-11) << 2)

/* Convert row bit number to register value */
#define ENC_DATA_WID(wid)       (wid == 8 ? FMC_SDRAM_MEM_BUS_WIDTH_8 : wid == 16 ? FMC_SDRAM_MEM_BUS_WIDTH_16 : FMC_SDRAM_MEM_BUS_WIDTH_32)

uint32_t FMC_SdramCheck();


/******************************************************************************
 * Do the Initialization of an SDRAM bank.
 * Parameters:
 *    fmc_idx      - FMC bank index [0 .. 3]
 *    sdram_data - neccessary timing and size parameters
 * initializes all associated IO pins and initializes the FMC bank. After return
 * the FMC bank is enabled/visible at its prefined memory address range
 * Returns
 *    true on success
 *    false in case of parameter or HAL layer initialization error
 *****************************************************************************/
bool Fmc_SDRAM_Init(uint32_t fmc_idx, const Fmc_SdramTimingDataT *sdram_data )
{
    FMC_SDRAM_InitTypeDef     *init;
    FMC_SDRAM_TimingTypeDef   SDRAM_Timing;
    uint32_t                  refreshCounter; // Value for the SDRAM controller refresh counter
    
    FmcDataT *curr   = FmcHandle.fmcData+fmc_idx; 
    
    /* Check for selected FMC bank being unused */
    if ( curr->fmcIsUsed ) {
        DEBUG_PRINTF("Fmc Bank #%d already used\n",  fmc_idx );
        return false;
    }

    /* Parameter Checking */
    
    /* Check DataWidth to be 8 or 16 */
    if ( sdram_data->DataBits != 8 && sdram_data->DataBits != 16 && sdram_data->DataBits != 32 ) {
        DEBUG_PRINTF("Data Width of Fmc Bank #%d invalid\n",  fmc_idx );
        return false;
    }

    /* Check Column address bits to be in the range [8 .. 11] */
    if ( sdram_data->ColBits < 8 || sdram_data->ColBits > 11 ) {
        DEBUG_PRINTF("Column Width of Fmc Bank #%d invalid\n",  fmc_idx );
        return false;
    }

    /* Check Row address bits to be in the range [11 .. 13] */
    if ( sdram_data->RowBits < 11 || sdram_data->RowBits > 13 ) {
        DEBUG_PRINTF("Column Width of Fmc Bank #%d invalid\n",  fmc_idx );
        return false;
    }
    /* Check SDRAM bank number to be in the range [1 ..2] */
    if ( sdram_data->sdramBankNum < 1 || sdram_data->sdramBankNum > 2 ) {
        DEBUG_PRINTF("Invalid SDRAM bank number for Fmc Bank #%d\n",  fmc_idx );
        return false;
    }

    /* Check CAS Latency to be in the range [1 .. 3] */
    if ( sdram_data->N_CASLatency < 1 || sdram_data->N_CASLatency > 3) {
        DEBUG_PRINTF("CAS latency of Fmc Bank #%d invalid\n",  fmc_idx );
        return false;
    }

    /* SDRAM device configuration */  
    curr->fmcRefClockSpeed = Fmc_SetSdramTiming( &SDRAM_Timing, sdram_data);
    if ( curr->fmcRefClockSpeed == 0 ) {
        DEBUG_PRINTF("Timing setup of Fmc Bank #%d failed\n",  fmc_idx );
        return false;
    }

    /* calculate refresh counter */
    if ((refreshCounter = Fmc_CalcSdram_RefreshCounter( sdram_data, curr->fmcRefClockSpeed ))==0) return false;

    curr->fmcIsUsed      = 1;
    curr->fmcType        = FMC_TYPE_SDRAM;
    curr->fmcSDBankNum   = sdram_data->sdramBankNum;
    /* Bit mask of all used Address and Data lines */
    curr->fmcAddrBits    = BITS_TO_MASK(sdram_data->ColBits) | BITS_TO_MASK(sdram_data->RowBits);
    /* independent from any SDRAM size/adress and data widths, A14 and A15 are use as bank select lines */
    curr->fmcAddrBits    |= ( 1 << 14 | 1 << 15 ); 

    curr->fmcDataBits    = BITS_TO_MASK(sdram_data->DataBits);

    /* Enable SDNWE, SDNCAS, SDNRAS, SDCLK and NBL0 in every case */
    curr->fmcCtlBits     = 1 << FMC_SDNWE_OFS | 1 << FMC_NCAS_OFS | 1 << FMC_NRAS_OFS | 1 << FMC_SDCLK_OFS | 1 << FMC_NBL0_OFS;

    /* Enable the proper Chip select and chip clock lines */
    if ( curr->fmcSDBankNum   == 1 ) {
        curr->fmcCtlBits |= ( 1 << FMC_SDNE0_OFS | 1 << FMC_SDCKE0_OFS );
    } else {
        curr->fmcCtlBits |= ( 1 << FMC_SDNE1_OFS | 1 << FMC_SDCKE1_OFS );
    }

    /* depending from the data with, enable more Byte-select lines */
    if ( sdram_data->DataBits > 8  ) curr->fmcCtlBits |= 1 << FMC_NBL1_OFS ;
    if (sdram_data->DataBits > 16 )  curr->fmcCtlBits |= ( 1 << FMC_NBL2_OFS | 1 << FMC_NBL3_OFS);

    curr->hHal.hsdram.Instance = FMC_SDRAM_DEVICE;
    init                       = &curr->hHal.hsdram.Init;
    init->SDBank               =  curr->fmcSDBankNum == 1 ? FMC_SDRAM_BANK1 : FMC_SDRAM_BANK2;
    init->ColumnBitsNumber     = ENC_COL_BITS(sdram_data->ColBits);       // HAL constants for this: FMC_SDRAM_COLUMN_BITS_NUM_9 eg
    init->RowBitsNumber        = ENC_ROW_BITS(sdram_data->RowBits);       // HAL constants for this: FMC_SDRAM_ROW_BITS_NUM_12 eg
    init->MemoryDataWidth      = ENC_DATA_WID(sdram_data->DataBits);      // HAL constants for this: FMC_SDRAM_MEM_BUS_WIDTH_8 eg
    init->CASLatency           = ENC_CAS_LATENCY(sdram_data->N_CASLatency);
    init->InternalBankNumber   = FMC_SDRAM_INTERN_BANKS_NUM_4;              // Always 4 Bank numbers
    init->WriteProtection      = FMC_SDRAM_WRITE_PROTECTION_DISABLE;
    init->SDClockPeriod        = FMC_SDRAM_CLOCK_PERIOD_2;                  // Always half the kernel clock
    init->ReadBurst            = FMC_SDRAM_RBURST_ENABLE;
    init->ReadPipeDelay        = FMC_SDRAM_RPIPE_DELAY_0;

    /* enable io lines and keep track of all activated IO lines  */
    FmcAddIOLines(curr);
 

    /* Initialize the SDRAM controller */
    if(HAL_SDRAM_Init(&curr->hHal.hsdram , &SDRAM_Timing) != HAL_OK) {
        DEBUG_PRINTF("SDRAM init for SDRAM Bank #%d failed\n",  curr->fmcSDBankNum );
        curr->fmcIsUsed = 0;
        return false;
    }

    SDRAM_Initialization(&curr->hHal.hsdram, init->SDBank);
    SDRAM_AutoRefresh(&curr->hHal.hsdram, init->SDBank, sdram_data->modeReg, refreshCounter);
    
    FMC_DumpOneSdramGeometry(fmc_idx, curr);

    
