rainer20512/stm32-fw/common/src/dev/fmc_dev.c
    #define BASE    0xD0000000
    #define VALUE   0xA5A5A5A5
    #define SIZE    0x2000000
    uint32_t sum = 0;
    for ( uint32_t i = 0; i < SIZE/4-1;i++ ) {
        *((uint32_t*)(BASE+i*4)) = VALUE;
        sum += VALUE;
    }
    sum = (~sum)+1;
    *((uint32_t*)(BASE+SIZE-4)) = sum;

    FMC_SdramCheck();

    return true;

}

uint32_t FMC_SdramCheck() 
{
    uint32_t sum = 0;
    uint32_t val;
    for ( uint32_t i = 0; i < SIZE/4-1;i++ ) {
        val = *((uint32_t*)(BASE+i*4));
        sum += val;
        if ( val != VALUE ) DEBUG_PRINTF("Wrong value 0x%08X at offset 0x%08X\n", val, i );
    }
    val = *((uint32_t*)(BASE+SIZE-4));
    sum += val;
    if ( sum != 0 ) DEBUG_PRINTF("Checksum 0x%08X is not correct\n",sum);
    return sum;
}

bool Fmc_ChngSdramTiming( uint32_t fmc_idx, Fmc_SdramTimingDataT *sdram_data )
{
    FmcDataT                  *curr    = FmcHandle.fmcData+fmc_idx; 
    SDRAM_HandleTypeDef       *hsdram  = &curr->hHal.hsdram;
    FMC_SDRAM_TimingTypeDef   SDRAM_Timing;
    uint32_t                  refreshCounter; // Value for the SDRAM controller refresh counter
    uint32_t                  newSdramClkSpeed;
    // uint32_t                  sdramBank = curr->fmcSDBankNum == 1 ? FMC_SDRAM_BANK1 : FMC_SDRAM_BANK2;

    /* Calculate new SDRAM timing parameters */  
    newSdramClkSpeed = Fmc_SetSdramTiming( &SDRAM_Timing, sdram_data);
    if ( newSdramClkSpeed == 0 ) {
        DEBUG_PRINTF("Change timing of Fmc Bank #%d failed\n",  fmc_idx );
        return false;
    }

    /* calculate refresh counter */
    if ((refreshCounter = Fmc_CalcSdram_RefreshCounter( sdram_data, curr->fmcRefClockSpeed ))==0) return false;
  
    /* Switch to Self refresh */
    SDRAM_SelfRefresh(hsdram, hsdram->Init.SDBank);

    /* change timing */
    FMC_SDRAM_Timing_Init(hsdram->Instance, &SDRAM_Timing, hsdram->Init.SDBank);

    /* Switch back to Auto-Refresh */
    SDRAM_AutoRefresh(hsdram, hsdram->Init.SDBank, sdram_data->modeReg, refreshCounter);

    return true;
}


///////////////////////////////////////////////////////////////////////////////
// Device functions ///////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////
void Fmc_DeInit(const HW_DeviceType *self)
{
    FmcHandleT *myFmc = Fmc_GetMyHandle(self);

    /* DeInit GPIO */
    GpioAFDeInitAll(GetDevIdx(&HW_FMC),self->devGpioAF);
  
    /* disable interrupts */
    if (self->devIrqList) HW_SetAllIRQs(self->devIrqList, false);

    for ( uint32_t i = 0; i < FMC_MAX_BLOCKS; i++ )
        if ( myFmc->fmcData[i].fmcIsUsed ) {
            switch ( myFmc->fmcData[i].fmcType ) {
#if USE_FMC_SRAM > 0 
                case FMC_TYPE_SRAM:
                    HAL_SRAM_DeInit(&(myFmc->fmcData[i].hHal.hsram));
                    break;
#endif
#if USE_FMC_NOR > 0 
                case FMC_TYPE_NOR:
                    HAL_NOR_DeInit(&(myFmc->fmcData[i].hHal.hnor));
                    break;
#endif
#if USE_FMC_NOR > 0 
                case FMC_TYPE_NAND:
                    HAL_NAND_DeInit&(myFmc->fmcData[i].hHal.hnand));
                    break;
#endif
#if USE_FMC_SDRAM > 0
                case FMC_TYPE_SDRAM:
                    HAL_SDRAM_DeInit(&(myFmc->fmcData[i].hHal.hsdram));
                    break;
#endif
                default:
                    DEBUG_PUTS("Fmc_DeInit: No type specific handler");
            }
    } // if, for

    /* To leave a clean state, reset QUADSPI hardware */
    HW_Reset((void *)self->devBase);

    /* disable FMC clock */
    Fmc_ClockInit(self, false );
}

/**************************************************************************************
 * Initialize quadrature encoder, i.e. set all GPIO pins and activate all interrupts  *
 * After successful initialization, the device is deactivated to reduce power         *
 * consumption. So, to use the device, it has to be activated first                   *
 *************************************************************************************/
bool Fmc_Init(const HW_DeviceType *self)
{
    FmcHandleT              *myFmcHandle = Fmc_GetMyHandle(self);
    const Fmc_ExtMemDataT   *extmemData;
    bool                    ret;
    uint32_t                i;
    
    Fmc_ClockInit(self, true );
    HW_Reset((void *)self->devBase);
    FmcResetMyHandle(myFmcHandle);

    for ( i = 0, ret=true; ret && i < FMC_MAX_BLOCKS; i++ ) {
        extmemData = Fmc_GetMyExtMemData(self, i);
        if ( extmemData ) switch ( extmemData->fmcType ) {
            case FMC_TYPE_SRAM:
                ret = Fmc_SRAM_Init(i,(Fmc_SramTimingDataT *)(extmemData->fmcTiming) );
                break;
            case FMC_TYPE_SDRAM:
                ret = Fmc_SDRAM_Init(i,(Fmc_SdramTimingDataT *)(extmemData->fmcTiming) );
                break;
            case FMC_TYPE_NOR:
            case FMC_TYPE_NAND:
            default:
                DEBUG_PRINTF("No init method for FMC type %d\n", extmemData->fmcType );
                ret = false;
        } // if, switch
    } // for


    return ret;
}

/******************************************************************************
 * Callback _after_ frequency changes: Recalculate the QUADSPI hardware 
 * prescaler to a give an operating freqency at or below desired frequency
 *****************************************************************************/
bool Fmc_OnFrqChange(const HW_DeviceType *self)
{
    FMC_NORSRAM_TimingTypeDef SRAM_Timing;
    const Fmc_ExtMemDataT *extmemData;

    FmcHandleT *myFmcHandle = Fmc_GetMyHandle(self);
    for ( uint32_t i = 0; i < FMC_MAX_BLOCKS; i++ ) if ( myFmcHandle->fmcData[i].fmcIsUsed ) {    
        extmemData = Fmc_GetMyExtMemData(self, i);
        switch(extmemData->fmcType ) {
            case FMC_TYPE_SRAM:
            case FMC_TYPE_NOR:
                if ( !Fmc_SetSramTiming( &SRAM_Timing, (Fmc_SramTimingDataT *)(extmemData->fmcTiming) ) ) {
                    DEBUG_PRINTF("Timing setup of SRAM Fmc Bank #%d failed\n", i );
                    return false;
                }
                /* change SRAM timing */
                (void)FMC_NORSRAM_Timing_Init(myFmcHandle->fmcData[i].hHal.hsram.Instance, &SRAM_Timing, myFmcHandle->fmcData[i].hHal.hsram.Init.NSBank);
            break;
            case FMC_TYPE_SDRAM:
                if ( !Fmc_ChngSdramTiming(i, (Fmc_SdramTimingDataT *)(extmemData->fmcTiming)) ) {
                    DEBUG_PRINTF("Timing setup of SDRAM Fmc Bank #%d failed\n", i );
                    return false;
                }
            break;
            case FMC_TYPE_NAND:
            default:
                DEBUG_PRINTF("No Timing setup for FMC type %d\n", extmemData->fmcType );
                return false;
        } // switch
    } // for

