rainer20512/stm32-fw/common/src/dev/fmc_dev.c
    return true;
}

/******************************************************************************
 * Callback _before_ going to sleep:
 * Put all dynamic memories into self refresh mode
 *****************************************************************************/
bool Fmc_OnSleep( const HW_DeviceType *self)
{
    FmcDataT                    *curr; 
    const Fmc_ExtMemDataT       *extmemData;
    SDRAM_HandleTypeDef         *hsdram;
    uint32_t                    i;
    
    for ( i = 0; i < FMC_MAX_BLOCKS; i++ ) {
        extmemData = Fmc_GetMyExtMemData(self, i);
        if ( extmemData ) switch ( extmemData->fmcType ) {
            case FMC_TYPE_SDRAM:
                curr            = FmcHandle.fmcData+i; 
                hsdram          = &curr->hHal.hsdram;
                /* Switch to Self refresh */
                SDRAM_SelfRefresh(hsdram, hsdram->Init.SDBank);
            break;
        } // if, switch
    } // for
    return true;
}

/******************************************************************************
 * Callback _after_ wakeup:
 * Put all dynamic memories back into normal(auto) refresh mode
 *****************************************************************************/
bool Fmc_OnWakeup( const HW_DeviceType *self)
{
    FmcDataT                    *curr; 
    const Fmc_ExtMemDataT       *extmemData;
    const Fmc_SdramTimingDataT  *sdram_data;
    SDRAM_HandleTypeDef         *hsdram;
    uint32_t                    i;
    uint32_t                    refreshCounter;
    
    for ( i = 0; i < FMC_MAX_BLOCKS; i++ ) {
        extmemData = Fmc_GetMyExtMemData(self, i);
        if ( extmemData ) switch ( extmemData->fmcType ) {
            case FMC_TYPE_SDRAM:
                curr            = FmcHandle.fmcData+i; 
                hsdram          = &curr->hHal.hsdram;
                sdram_data      = (const Fmc_SdramTimingDataT *)(extmemData->fmcTiming);
                refreshCounter  = Fmc_CalcSdram_RefreshCounter( sdram_data, curr->fmcRefClockSpeed );
                /* Switch back to Auto-Refresh */
                SDRAM_AutoRefresh(hsdram, hsdram->Init.SDBank, sdram_data->modeReg, refreshCounter);
            break;
        } // if, switch
    } // for
    return true;
}


///////////////////////////////////////////////////////////////////////////////
// Global Variables  /////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////
#if defined(FMC_Bank1_R) && USE_FMC > 0 
    FmcHandleT  FmcHandle;

    #if defined( FMC_USE_IRQ )
    const HW_IrqList irq_fmc = {
        .num = 1,
        .irq = {FMC_IRQ },
    };
    #endif

    /* 16 or 32 Data pins, up to 26 Addr pins, FMC_CTL_MAX control pins */
    static const HW_GpioList_AF gpio_fmc = {
        .num  = FMC_D_MAX + FMC_A_MAX + FMC_CTL_MAX,
        .gpio = { 
            FMC_D00, FMC_D01, FMC_D02, FMC_D03, FMC_D04, FMC_D05, FMC_D06, FMC_D07,
            FMC_D08, FMC_D09, FMC_D10, FMC_D11, FMC_D12, FMC_D13, FMC_D14, FMC_D15,
            #if FMC_D_MAX > 16
                FMC_D16, FMC_D17, FMC_D18, FMC_D19, FMC_D20, FMC_D21, FMC_D22, FMC_D23, 
                FMC_D24, FMC_D25, FMC_D26, FMC_D27, FMC_D28, FMC_D29, FMC_D30, FMC_D31,
            #endif

            FMC_A00, FMC_A01, FMC_A02, FMC_A03, FMC_A04, FMC_A05, FMC_A06, FMC_A07,
            FMC_A08, FMC_A09, FMC_A10, FMC_A11, FMC_A12, FMC_A13, FMC_A14, FMC_A15,
            FMC_A16, FMC_A17, FMC_A18, FMC_A19, FMC_A20, FMC_A21, FMC_A22, FMC_A23, 
            FMC_A24, FMC_A25, 

            FMC_CTL_CLK,   FMC_CTL_NWAIT,  FMC_CTL_NOE,     FMC_CTL_NWE,
            FMC_CTL_NE1,   FMC_CTL_NE2,    FMC_CTL_NE3,     FMC_CTL_NE4,
            FMC_CTL_NBL0,  FMC_CTL_NBL1,   FMC_CTL_NBL2,    FMC_CTL_NBL3,   
            FMC_CTL_INT,     FMC_CTL_NL,
            FMC_CTL_SDNWE, FMC_CTL_SDNCAS, FMC_CTL_SDNRAS,  FMC_CTL_SDNE0,
            FMC_CTL_SDNE1, FMC_CTL_SDCKE0, FMC_CTL_SDCKE1,  FMC_CTL_SDCLK,
        }
    };

        #define FMC_T1      NULL
        #define FMC_T2      NULL

    #if defined(FMC_TYPE3)
        #if FMC_TYPE3 == FMC_TYPE_SDRAM
            static const Fmc_SdramTimingDataT memdata3 = SDRAM_TIMING3;
        #elif FMC_TYPE3 == FMC_TYPE_SRAM
            static const Fmc_SramTimingDataT memdata3  = SRAM_TIMING3;
        #else
            #error "No Memory data for external memory block 3"
        #endif
        static const Fmc_ExtMemDataT extmem3 = { &memdata3, FMC_TYPE3 };
        #define FMC_T3      &extmem3
    #else   
        #define FMC_T3      NULL
    #endif
 
    #if defined(FMC_TYPE4)
        #if FMC_TYPE4 >= FMC_TYPE_SDRAM
            static const Fmc_SdramTimingDataT memdata4 = SDRAM_TIMING4;
        #elif FMC_TYPE4 >= FMC_TYPE_SRAM
            static const Fmc_SramTimingDataT memdata4  = SRAM_TIMING4;
        #else
            #error "No Memory data for external memory block 4"
        #endif
        static const Fmc_ExtMemDataT extmem4 = { &memdata4, FMC_TYPE4 };
        #define FMC_T4      &extmem4
    #else   
        #define FMC_T4      NULL
    #endif

    static const Fmc_AdditionalDataType additional_fmc = {
        .myFmcHandle  = &FmcHandle,
        .myExtMemData = { FMC_T1, FMC_T2, FMC_T3, FMC_T4 },
    };


const HW_DeviceType HW_FMC = {
    .devName        = "FMC",
    .devBase        = FMC_Bank1_R,
    .devGpioAF      = &gpio_fmc,
    .devType        = HW_DEVICE_FMC,
    .devData        = &additional_fmc,
    .devIrqList     = 
        #if defined(FMC_USE_IRQ) 
            &irq_fmc,
        #else
            NULL,
        #endif
    .devDmaRx       = NULL, 
    .devDmaTx       = NULL, 
    .Init           = Fmc_Init,
    .DeInit         = Fmc_DeInit,
    .OnFrqChange    = Fmc_OnFrqChange,
    .AllowStop      = NULL,
    .OnSleep        = Fmc_OnSleep,
    .OnWakeUp       = Fmc_OnWakeup,
};
#endif

#if 0
void FMC_PostInit( const HW_DeviceType *self, void *args)
{
    UNUSED(self); UNUSED(args);

    FMC_NORSRAM_InitTypeDef Init;

    if (!Fmc_SRAM_Init(self, &Init)) {
        DEBUG_PUTS("FMC SRAM init failed!");
    }

    #if 0
    uint16_t *extmemptr = (uint16_t *)(0x60000000 );
    for ( uint32_t i = 0; i < 1 << 23; i++ )
        *(extmemptr + i) = 0;
    #endif
}
#endif


#endif /* if USE_FMC > 0 */


/**
  * @}
  */


